; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph5 - mode
	spectrograph2 - mode
	thermograph6 - mode
	infrared7 - mode
	spectrograph0 - mode
	infrared3 - mode
	spectrograph1 - mode
	infrared8 - mode
	spectrograph4 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	Star3 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared7)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared7)
	(supports instrument1 thermograph5)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared3)
	(supports instrument2 infrared7)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared8)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 GroundStation2)
	(have_image Planet6 infrared3)
	(have_image Planet6 thermograph6)
	(have_image Planet6 spectrograph2)
	(have_image Phenomenon7 infrared7)
	(have_image Planet8 spectrograph2)
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 thermograph5)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon9 infrared7)
	(have_image Phenomenon10 thermograph5)
	(have_image Phenomenon10 infrared7)
	(have_image Phenomenon11 infrared7)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon11 thermograph6)
))

)

; plan
1. (turn_to satellite1 star3 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star3)
   goals met: 0 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 16
4. (turn_to satellite0 phenomenon9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 16
5. (take_image satellite0 phenomenon9 instrument1 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 1 of 16
6. (take_image satellite0 phenomenon9 instrument1 infrared7)
   added: (have_image phenomenon9 infrared7)
   goals met: 2 of 16
7. (turn_to satellite0 phenomenon10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 16
8. (take_image satellite0 phenomenon10 instrument1 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 3 of 16
9. (take_image satellite0 phenomenon10 instrument1 infrared7)
   added: (have_image phenomenon10 infrared7)
   goals met: 4 of 16
10. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   goals met: 4 of 16
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 16
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 16
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 16
14. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 4 of 16
15. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 4 of 16
16. (turn_to satellite0 phenomenon11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 16
17. (take_image satellite0 phenomenon11 instrument0 infrared7)
   added: (have_image phenomenon11 infrared7)
   goals met: 5 of 16
18. (take_image satellite0 phenomenon11 instrument0 thermograph6)
   added: (have_image phenomenon11 thermograph6)
   goals met: 6 of 16
19. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 16
20. (take_image satellite0 phenomenon7 instrument0 infrared7)
   added: (have_image phenomenon7 infrared7)
   goals met: 7 of 16
21. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 7 of 16
22. (take_image satellite0 planet6 instrument0 thermograph6)
   added: (have_image planet6 thermograph6)
   goals met: 8 of 16
23. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 8 of 16
24. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 8 of 16
25. (turn_to satellite0 groundstation5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation5)
   goals met: 8 of 16
26. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 8 of 16
27. (turn_to satellite0 planet6 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet6)
   goals met: 8 of 16
28. (take_image satellite0 planet6 instrument2 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 9 of 16
29. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   goals met: 10 of 16
30. (turn_to satellite1 phenomenon11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon11)
   goals met: 10 of 16
31. (take_image satellite1 phenomenon11 instrument3 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 11 of 16
32. (turn_to satellite1 phenomenon9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon9)
   goals met: 11 of 16
33. (take_image satellite1 phenomenon9 instrument3 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 12 of 16
34. (turn_to satellite1 planet6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet6)
   goals met: 12 of 16
35. (take_image satellite1 planet6 instrument3 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 13 of 16
36. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 13 of 16
37. (take_image satellite1 planet8 instrument3 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 14 of 16
38. (take_image satellite1 planet8 instrument3 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 15 of 16
39. (turn_to satellite1 groundstation2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation2)
   goals met: 16 of 16
